Autodesk.Revit.DB.ParameterTypeId.RbsPipeBottomElevation
"Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTopElevation
"Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalAreaMeasurement
"Area Measurement"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodePowerSource
"Power Source"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalAreaParam
"Specified Area"

Autodesk.Revit.DB.ParameterTypeId.RbsElectricalLoadZoneType
"Electrial Load Zone Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadDensity
"Load Density"

Autodesk.Revit.DB.ParameterTypeId.FabricationBraSize
"Size of Primary Branch End"

Autodesk.Revit.DB.ParameterTypeId.FabricationSecSize
"Size of Secondary End"

Autodesk.Revit.DB.ParameterTypeId.FabricationPriSize
"Size of Primary End"

Autodesk.Revit.DB.ParameterTypeId.FabricationPipeInvertElevation
"Pipe Invert Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationCenterlineElevationOfPart
"Centerline Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationSpotBottomElevationIncludeInsulationOfPart
"Spot Bottom Elevation with Insulation"

Autodesk.Revit.DB.ParameterTypeId.FabricationSpotBottomElevationOfPart
"Spot Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationSpotTopElevationIncludeInsulationOfPart
"Spot Top Elevation with Insulation"

Autodesk.Revit.DB.ParameterTypeId.FabricationSpotTopElevationOfPart
"Spot Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationBottomOfPart
"Bottom"

Autodesk.Revit.DB.ParameterTypeId.FabricationTopOfPart
"Top"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctBottomElevation
"Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctTopElevation
"Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeInvertElevation
"Invert Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsCtcBottomElevation
"Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsCtcTopElevation
"Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.FamilyEnableCuttingInViews
"Enable cutting in views"

Autodesk.Revit.DB.ParameterTypeId.ImportBaseLevelOffset
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.ImportBaseLevel
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.MultiLeaderTagUi
"Multi Leader Tag": Used by IndependentTagEditor for UI binding